/*
************************************************************************************************
主要的包含文件

文 件: INCLUDES.C ucos包含文件
作 者: Jean J. Labrosse
************************************************************************************************
*/

#ifndef __INCLUDES_H__
#define __INCLUDES_H__
#include "led.h"
#include "delay.h"
#include "key.h"
#include "sys.h"
#include "ILI93xx.h"
#include "LCD.h"
#include "ft5206.h"
#include "usart.h"	 
#include "24cxx.h"
#include "flash.h"
#include "touch.h"
#include "timer.h"
#include "malloc.h"
#include "touch.h"
#include "sram.h"

#include "limits.h"
#include "GUI.h"

#include "string.h"


/*****************************************************ar_用户头文件接口********************************************************/


//--------------------------------------------
//任务头文件

//--------------------------------------------


//--------------------------------------------
//USMART头文件

//--------------------------------------------




//--------------------------------------------
//FATFS头文件
#include "diskio.h"		/* FatFs lower layer API */
#include "mmc_sd.h"
#include "flash.h"
#include "malloc.h"		
#include "exfuns.h"
#include "fattester.h"	 
#include "ff.h"			/* Declarations of FatFs API */
#include "fontupd.h"
#include "MMC_SD.h" 
//--------------------------------------------


//--------------------------------------------
//emwin Demo头文件


//--------------------------------------------



//--------------------------------------------
//emwin 汉字显示头文件


#include "EmWinHZFont.h"
//--------------------------------------------


//--------------------------------------------
//emwin 流位图显示头文件


//--------------------------------------------



//--------------------------------------------
//emwin GUI builer头文件

#include "DIALOG.h"
//--------------------------------------------














/*****************************************************ar_用户头文件接口********************************************************/
#endif































